{
  "articles": [
    {
      "title": "US Treasury issues first-ever sanctions against a cryptocurrency mixer-edit",
      "content": "Cryptocurrency mixers are sometimes used to help online criminals launder their stolen money by hiding its true origins, and the US Treasury is now ready to clamp down on them when hostile government… [+1432 chars]",
      "author": "Jon Fingassss",
      "url": "https://www.engadget.com/us-treasury-sanctions-virtual-currency-mixer-north-korea-203502517.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-11/0db21000-4246-11ec-a8de-edfca39c0e00",
      "description": "Cryptocurrency mixers are sometimes used to help online criminals launder their stolen money by hiding its true origins, and the US Treasury is now ready to clamp down on them when hostile governments are involved. The department has issued its first sanction…",
      "id": 1
    },
    {
      "id": 2,
      "author": "Timothy B. Lee",
      "title": "Wikipedia community votes to stop accepting cryptocurrency donations",
      "description": "Critics argue the bitcoin and ethereum networks consume too much energy.",
      "url": "https://arstechnica.com/tech-policy/2022/04/wikipedia-community-votes-to-stop-accepting-cryptocurrency-donations/",
      "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/04/GettyImages-922703938-760x380.jpg",
      "publishedAt": "2022-04-13T16:35:03Z",
      "content": "18 with 15 posters participating, including story author\r\nMore than 200 long-time Wikipedia editors have requested that the Wikimedia Foundation stop accepting cryptocurrency donations. The foundatio… [+4016 chars]"
    },
    {
      "id": 3,
      "author": "Kevin Hurler",
      "title": "You Can Now Go See Fantastic Beasts With Dogecoin at AMC Theaters",
      "description": "Dogecoiners unite! Movie theater chain AMC has welcomed some more cryptocurrencies as payment options for online and mobile purchases. In a tweet on April 15, AMC CEO Adam Aron announced that moviegoers can now pay for movie tickets and concessions using Doge…",
      "url": "https://gizmodo.com/you-can-now-go-see-fantastic-beasts-with-dogecoin-at-am-1848805758",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/9c1a5c315585258a257319589a2c2bf5.jpg",
      "publishedAt": "2022-04-18T20:30:00Z",
      "content": "Dogecoiners unite! Movie theater chain AMC has welcomed some more cryptocurrencies as payment options for online and mobile purchases. In a tweet on April 15, AMC CEO Adam Aron announced that moviego… [+1603 chars]"
    },
    {
      "id": 4,
      "author": "Ekalavya Hansaj",
      "content": "In the early days of search engine optimization (SEO), keywords were everything. Many search engines including Google relied heavily on matching keywords and phrases in a users search query with real… [+6606 chars]",
      "description": "The search engine optimization game used to revolve around keywords. SEO has come a long way since then - but does that mean you should abandon keywords?",
      "publishedAt": "2022-03-18T13:00:00Z",
      "title": "Why Keywords Still Matter in SEO (But They Aren't Everything)",
      "url": "https://www.entrepreneur.com/article/422701",
      "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/1649434644-shutterstock-579035593.jpg"
    },
    {
      "id": 5,
      "author": "Mariella Moon",
      "title": "Opera's crypto browser is now available on iOS",
      "description": "Opera launched its dedicated \"Crypto Browser\" into beta back in January, promising to make Web3 as accessible as any Web2 website. The company released the browser for Windows, Mac and Android users back then, but the version for iOS devices still wasn't read…",
      "url": "https://www.engadget.com/operas-crypto-browser-ios-113713720.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-04/d7564890-bca3-11ec-b7ff-a905e1f2a795",
      "publishedAt": "2022-04-15T11:37:13Z",
      "content": "Opera launched its dedicated \"Crypto Browser\" into beta back in January, promising to make Web3 as accessible as any Web2 website. The company released the browser for Windows, Mac and Android users … [+1563 chars]"
    },
    {
      "id": 6,
      "author": "Kourtnee Jackson",
      "title": "Central African Republic Passes Bill to Make Bitcoin Legal Tender - CNET",
      "description": "The nation is the second in line to make bitcoin a form of legal payment.",
      "url": "https://www.cnet.com/personal-finance/crypto/central-african-republic-passes-bill-to-make-bitcoin-legal-tender/",
      "urlToImage": "https://www.cnet.com/a/img/resize/254465c78aa125dceeb1d745c522cdd52ce7f7b1/2022/04/22/5e2b33a9-9ee6-400b-a99e-21bd935e2912/bitcoin-crypto-logo-2022-614.jpg?auto=webp&fit=crop&height=630&width=1200",
      "publishedAt": "2022-04-27T15:44:58Z",
      "content": "The Central African Republic has adopted bitcoin as legal tender, making it the second nation in the world -- after El Salvador -- to do so. On Wednesday, President Faustin Archange Touadera's office… [+1078 chars]"
    },
    {
      "id": 7,
      "author": "Justine Calma",
      "title": "Why fossil fuel companies see green in Bitcoin mining projects",
      "description": "ExxonMobil and other fossil fuel companies have turned to Bitcoin mining to address a gas problem. But their plans come with risks.",
      "url": "https://www.theverge.com/2022/5/4/23055761/exxonmobil-cryptomining-bitcoin-methane-gas",
      "urlToImage": "https://cdn.vox-cdn.com/thumbor/BZdljrBbt8tBl6oCCnckcDKqe6g=/0x90:4608x2503/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23435975/1240300988.jpg",
      "publishedAt": "2022-05-04T12:00:00Z",
      "content": "A Bitcoin mining site powered by otherwise lost gas from an oil well near Linden, Texas, on April 4th, 2022. | Photo by FRANCOIS PICARD/AFP via Getty Images\r\n\n \n\n Of all the corporate climate hype fl… [+6544 chars]"
    },
    {
      "id": 8,
      "author": "Mariella Moon",
      "title": "Wikipedia editors vote to block cryptocurrency donations",
      "description": "Wikipedia editors have voted in favor of dropping cryptocurrency from the Wikimedia Foundation's donation options. As Ars Technica reports, an editor for the online encyclopedia called GorillaWarfare wrote a proposal for the foundation to stop accepting crypt…",
      "url": "https://www.engadget.com/wikipedia-editors-vote-to-block-cryptocurrency-donations-113549175.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-07/9f595ce0-de17-11eb-bef2-e1b1456d84ae",
      "publishedAt": "2022-04-14T11:35:49Z",
      "content": "Wikipedia editors have voted in favor of dropping cryptocurrency from the Wikimedia Foundation's donation options. As Ars Technica reports, an editor for the online encyclopedia called GorillaWarfare… [+1577 chars]"
    },
    {
      "id": 9,
      "author": "Matt Novak",
      "title": "Warren Buffett Says He Wouldn't Take All the Bitcoin in the World for $25",
      "description": "Warren Buffett has always been a bitcoin skeptic. But the billionaire investor had his most harsh words yet for the cryptocurrency over the weekend. Buffett made it clear that his opposition to crypto has nothing to do with whether people can make money tradi…",
      "url": "https://gizmodo.com/warren-buffett-all-bitcoin-world-25-dollars-assets-valu-1848866967",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bbc389f90510758bf8f4131a7e2cbacd.png",
      "publishedAt": "2022-05-02T11:30:00Z",
      "content": "Warren Buffett has always been a bitcoin skeptic. But the billionaire investor had his most harsh words yet for the cryptocurrency over the weekend. Buffett made it clear that his opposition to crypt… [+2297 chars]"
    }
  ],
  "admin": [
    {
      "id": "admin-login",
      "email": "admin@news.com",
      "password": "admin123456"
    }
  ]
}